cavityTest/cavity/cavity120/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner   DILU;
        tolerance       1e-07;
        relTol          0;
    }
    UFinal
    {
        $U;
    }
}

PIMPLE
{
    	nOuterCorrectors    1;
	nCorrectors 	4;
	nNonOrthogonalCorrectors 0;
	pRefPoint	(0.0 0 0);
	pRefValue	0.0;
}



// ************************************************************************* //
